### Cleaning the migration dataset through SQL

In [1]:
# Python SQL toolkit and Object Relational Mapper
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
import json

### Store CSV into DataFrame
Migration dataset source: https://www.kaggle.com/finnegannguyen/statetostate-migration-flows-from-2010-to-2019
From there, grab unique current states and get lat and lon through a gmap request

In [2]:
csv_file_state = "Blog/flaskblog/static/data/state_coord.csv"
state_coord = pd.read_csv(csv_file_state)
state_coord.head()

        state        lat         lng
0     Alabama  32.318231  -86.902298
1      Alaska  64.200841 -149.493673
2     Arizona  34.048928 -111.093731
3    Arkansas  35.201050  -91.831833
4  California  36.778261 -119.417932

In [3]:
# import the migration file
migration_file = "Blog/flaskblog/static/data/data_raw.csv"
migration_df = pd.read_csv(migration_file)
migration_df.head()

,current_state,year,population,same_house,same_state,from_different_state_Total,abroad_Total,from,number_of_people
0,Alabama,2010,4729509,3987155,620465,108723,13166,Alabama,0
1,Alaska,2010,702974,565031,95878,36326,5739,Alabama,477
2,Arizona,2010,6332786,5069002,1001991,222725,39068,Alabama,416
3,Arkansas,2010,2888304,2387806,412997,79127,8374,Alabama,1405
4,California,2010,36907897,30790221,5413287,444749,259640,Alabama,3364

In [4]:
# get only the columns needed
migration_df = migration_df[['current_state', 'year', 'population','from','number_of_people']].copy()

In [5]:
# rename the columns
migration_df = migration_df.rename(columns={"current_state": "destination", "from": "origin", "number_of_people": "total"})
migration_df.head()

  destination  year  population   origin  total
0     Alabama  2010     4729509  Alabama      0
1      Alaska  2010      702974  Alabama    477
2     Arizona  2010     6332786  Alabama    416
3    Arkansas  2010     2888304  Alabama   1405
4  California  2010    36907897  Alabama   3364

In [6]:
# find the unique states, to ensure that there is a match with foreign key
migration_df['origin'].unique()

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'District of Columbia ',
       'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana',
       'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine', 'Maryland',
       'Massachusetts', 'Michigan', 'Minnesota', 'Mississippi',
       'Missouri', 'Montana', 'Nebraska', 'Nevada', 'New Hampshire',
       'New Jersey', 'New Mexico', 'New York', 'North Carolina',
       'North Dakota', 'Ohio', 'Oklahoma', 'Oregon', 'Pennsylvania',
       'Rhode Island', 'South Carolina', 'South Dakota', 'Tennessee',
       'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington',
       'West Virginia', 'Wisconsin', 'Wyoming', 'abroad_PuertoRico',
       'abroad_USIslandArea', 'abroad_ForeignCountry'], dtype=object)

In [7]:
#include only list where state has coordinates from the other csv file
inc_list = state_coord['state'].tolist()

In [8]:
migration_df = migration_df[migration_df['origin'].isin(inc_list)]
migration_df['origin'].unique()

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Delaware', 'District of Columbia ',
       'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois', 'Indiana',
       'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine', 'Maryland',
       'Massachusetts', 'Michigan', 'Minnesota', 'Mississippi',
       'Missouri', 'Montana', 'Nebraska', 'Nevada', 'New Hampshire',
       'New Jersey', 'New Mexico', 'New York', 'North Carolina',
       'North Dakota', 'Ohio', 'Oklahoma', 'Oregon', 'Pennsylvania',
       'Rhode Island', 'South Carolina', 'South Dakota', 'Tennessee',
       'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington',
       'West Virginia', 'Wisconsin', 'Wyoming'], dtype=object)

In [9]:
postal_data = "Blog/flaskblog/static/data/postal_data.csv"
postal_df = pd.read_csv(postal_data)
postal_df.head()

        state postal
0     Alabama     AL
1      Alaska     AK
2     Arizona     AZ
3    Arkansas     AR
4  California     CA

### Connect to local database

In [10]:
rds_connection_string = "postgres:postgres@localhost:5432/project_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

### Check for tables

In [11]:
# Confirm tables
engine.table_names()

<ipython-input-11-2d97e9123e98>:2: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['migration_table', 'states_coord', 'postal_data']

### Load the Datasets

In [12]:
state_coord.to_sql(name='states_coord', con=engine, if_exists='append', index=False)

In [13]:
migration_df.to_sql(name='migration_table', con=engine, if_exists='append', index=False)

In [14]:
postal_df.to_sql(name='postal_data', con=engine, if_exists='append', index=False)

### Confirm data has been added

In [15]:
sql_one = pd.read_sql_query('select * from states_coord', con=engine)
sql_one = pd.DataFrame(sql_one)

In [16]:
sql_two = pd.read_sql_query('select * from migration_table', con=engine)
sql_two = pd.DataFrame(sql_two)

In [17]:
sql_three = pd.read_sql_query('select * from postal_data', con=engine)
sql_three = pd.DataFrame(sql_three)

### Use sql data to clean and filter in jupyter

In [18]:
migration_merged = sql_two.merge(sql_one, left_on='destination', right_on='state',
          suffixes=('_left', '_right'))
migration_merged = migration_merged.drop(['state'], axis=1)
migration_merged = migration_merged.rename(columns={"lat": "destination_lat", "lng": "destination_lng"})

In [19]:
migration_merged = migration_merged.merge(sql_one, left_on='origin', right_on='state',
          suffixes=('_left', '_right'))
migration_merged = migration_merged.drop(['state'], axis=1)
migration_merged = migration_merged.rename(columns={"lat": "origin_lat", "lng": "origin_lng"})

In [20]:
# migration_merged = migration_merged.re_index()
migration_merged.head()

,destination,year,population,origin,total,destination_lat,destination_lng,origin_lat,origin_lng
0,Alabama,2010,4729509,Alabama,0,32,-87,32,-87
1,Alabama,2011,4745278,Alabama,0,32,-87,32,-87
2,Alabama,2012,4764428,Alabama,0,32,-87,32,-87
3,Alabama,2013,4781296,Alabama,0,32,-87,32,-87
4,Alabama,2014,4791931,Alabama,0,32,-87,32,-87

In [21]:
migration_merged.to_csv("Blog/flaskblog/static/data/migration_merged.csv",index=False)

In [22]:
state_merged = migration_merged.merge(sql_three, left_on='destination', right_on='state',
          suffixes=('_left', '_right'))
state_merged = state_merged.drop(['state'], axis=1)
state_merged.head()

,destination,year,population,origin,total,destination_lat,destination_lng,origin_lat,origin_lng,postal
0,Alabama,2010,4729509,Alabama,0,32,-87,32,-87,AL
1,Alabama,2011,4745278,Alabama,0,32,-87,32,-87,AL
2,Alabama,2012,4764428,Alabama,0,32,-87,32,-87,AL
3,Alabama,2013,4781296,Alabama,0,32,-87,32,-87,AL
4,Alabama,2014,4791931,Alabama,0,32,-87,32,-87,AL

In [23]:
# state_merged = state_merged.groupby(['destination','postal','year']).sum()
# state_merged.head()

In [24]:
# state_merged = state_merged.reset_index()
state_merged = state_merged[['destination','year','total','postal','origin']]

In [25]:
state_merged = state_merged.groupby(['destination','year']).sum().groupby(level=0).cumsum().reset_index()

In [26]:
state_merged.head()

  destination  year   total
0     Alabama  2010  108723
1     Alabama  2011  226449
2     Alabama  2012  331049
3     Alabama  2013  435151
4     Alabama  2014  543070

In [27]:
state_merged['pct_ch'] = (state_merged.groupby('destination')['total']
                                  .apply(pd.Series.pct_change) + 1)

In [28]:
state_merged.head(30)

   destination  year    total    pct_ch
0      Alabama  2010   108723       NaN
1      Alabama  2011   226449  2.082807
2      Alabama  2012   331049  1.461914
3      Alabama  2013   435151  1.314461
4      Alabama  2014   543070  1.248004
5      Alabama  2015   657946  1.211531
6      Alabama  2016   780166  1.185760
7      Alabama  2017   891969  1.143307
8      Alabama  2018  1001270  1.122539
9      Alabama  2019  1106050  1.104647
10      Alaska  2010    36326       NaN
11      Alaska  2011    71410  1.965810
12      Alaska  2012   104825  1.467932
13      Alaska  2013   139185  1.327784
14      Alaska  2014   177027  1.271883
15      Alaska  2015   211723  1.195993
16      Alaska  2016   243023  1.147835
17      Alaska  2017   273222  1.124264
18      Alaska  2018   305321  1.117483
19      Alaska  2019   339352  1.111460
20     Arizona  2010   222725       NaN
21     Arizona  2011   445602  2.000682
22     Arizona  2012   678059  1.521670
23     Arizona  2013   914205  1.348268
24     Arizona  2014  1163935  1.273166
25     Arizona  2015  1417216  1.217608
26     Arizona  2016  1690473  1.192813
27     Arizona  2017  1952200  1.154825
28     Arizona  2018  2225914  1.140208
29     Arizona  2019  2479209  1.113794

In [29]:
state_merged = state_merged.merge(sql_three, left_on='destination', right_on='state',
          suffixes=('_left', '_right'))
state_merged = state_merged.drop(['state'], axis=1)
state_merged = state_merged.round({'pct_ch': 2})
state_merged.head(50)

   destination  year    total  pct_ch postal
0      Alabama  2010   108723     NaN     AL
1      Alabama  2011   226449    2.08     AL
2      Alabama  2012   331049    1.46     AL
3      Alabama  2013   435151    1.31     AL
4      Alabama  2014   543070    1.25     AL
5      Alabama  2015   657946    1.21     AL
6      Alabama  2016   780166    1.19     AL
7      Alabama  2017   891969    1.14     AL
8      Alabama  2018  1001270    1.12     AL
9      Alabama  2019  1106050    1.10     AL
10      Alaska  2010    36326     NaN     AK
11      Alaska  2011    71410    1.97     AK
12      Alaska  2012   104825    1.47     AK
13      Alaska  2013   139185    1.33     AK
14      Alaska  2014   177027    1.27     AK
15      Alaska  2015   211723    1.20     AK
16      Alaska  2016   243023    1.15     AK
17      Alaska  2017   273222    1.12     AK
18      Alaska  2018   305321    1.12     AK
19      Alaska  2019   339352    1.11     AK
20     Arizona  2010   222725     NaN     AZ
21     Arizona  2011   445602    2.00     AZ
22     Arizona  2012   678059    1.52     AZ
23     Arizona  2013   914205    1.35     AZ
24     Arizona  2014  1163935    1.27     AZ
25     Arizona  2015  1417216    1.22     AZ
26     Arizona  2016  1690473    1.19     AZ
27     Arizona  2017  1952200    1.15     AZ
28     Arizona  2018  2225914    1.14     AZ
29     Arizona  2019  2479209    1.11     AZ
30    Arkansas  2010    79127     NaN     AR
31    Arkansas  2011   148972    1.88     AR
32    Arkansas  2012   225920    1.52     AR
33    Arkansas  2013   296541    1.31     AR
34    Arkansas  2014   371282    1.25     AR
35    Arkansas  2015   452876    1.22     AR
36    Arkansas  2016   523959    1.16     AR
37    Arkansas  2017   603370    1.15     AR
38    Arkansas  2018   676549    1.12     AR
39    Arkansas  2019   736272    1.09     AR
40  California  2010   444749     NaN     CA
41  California  2011   913177    2.05     CA
42  California  2012  1406818    1.54     CA
43  California  2013  1892295    1.35     CA
44  California  2014  2406263    1.27     CA
45  California  2015  2920740    1.21     CA
46  California  2016  3435498    1.18     CA
47  California  2017  3958629    1.15     CA
48  California  2018  4459652    1.13     CA
49  California  2019  4939856    1.11     CA

In [30]:
state_merged.to_csv("Blog/flaskblog/static/data/state_merged.csv",index=True)

In [31]:
state_merged['pct_ch'].max()

2.26

In [32]:
grouped_migration = migration_merged[['year','total']]
grouped_migration = grouped_migration.groupby(['year']).sum()
grouped_migration = grouped_migration.reset_index()

In [33]:
grouped_migration

   year    total
0  2010  6774961
1  2011  7010065
2  2012  7090389
3  2013  7231985
4  2014  7353940
5  2015  7554891
6  2016  7573732
7  2017  7491660
8  2018  7592182
9  2019  7429481

In [34]:
difference = grouped_migration.diff()
difference

   year     total
0   NaN       NaN
1   1.0  235104.0
2   1.0   80324.0
3   1.0  141596.0
4   1.0  121955.0
5   1.0  200951.0
6   1.0   18841.0
7   1.0  -82072.0
8   1.0  100522.0
9   1.0 -162701.0

In [35]:
change = pd.DataFrame((difference['total']/grouped_migration['total'])*100)
change = change.rename(columns={"total": "change"})
change = change.cumsum()

In [36]:
grouped_migration = pd.concat([grouped_migration, change], axis=1)

In [37]:
grouped_migration = grouped_migration.round({'change': 1})

In [38]:
grouped_migration.head(10)

   year    total  change
0  2010  6774961     NaN
1  2011  7010065     3.4
2  2012  7090389     4.5
3  2013  7231985     6.4
4  2014  7353940     8.1
5  2015  7554891    10.8
6  2016  7573732    11.0
7  2017  7491660     9.9
8  2018  7592182    11.2
9  2019  7429481     9.1

In [39]:
grouped_migration.to_json("Blog/flaskblog/static/data/grouped_migration.json")